


MIP6 Working Group                                          Hee Jin Jang
Internet-Draft                                               Alper Yegin
Intended status: Standards Track                                 SAMSUNG
Expires: December 15, 2007                              Kuntal Chowdhury
                                                        Starent Networks
                                                          JinHyeock Choi
                                                                 SAMSUNG
                                                           June 13, 2007


          DHCP Option for Home Information Discovery in MIPv6
                      draft-ietf-mip6-hiopt-05.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on December 15, 2007.

Copyright Notice

   Copyright (C) The IETF Trust (2007).










Jang, et al.            Expires December 15, 2007               [Page 1]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


Abstract

   This draft defines a DHCP-based scheme to enable dynamic discovery of
   Mobile IPv6 home network information.  New DHCP options are defined
   which allow a mobile node to request the home agent IP address, FQDN,
   or home subnet prefix and obtain it via the DHCP response.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  DHCP options for HA Dynamic Discovery  . . . . . . . . . . . .  5
     3.1.  Home Network Identifier Option . . . . . . . . . . . . . .  5
     3.2.  MIP6 Relay Agent Option  . . . . . . . . . . . . . . . . .  7
       3.2.1.  MIP6 Relay Agent Sub-option  . . . . . . . . . . . . .  7
     3.3.  Home Network Information Option  . . . . . . . . . . . . .  9
       3.3.1.  Home Network Information Sub-option  . . . . . . . . . 10
   4.  Option Usage . . . . . . . . . . . . . . . . . . . . . . . . . 12
     4.1.  Mobile Node Behavior . . . . . . . . . . . . . . . . . . . 12
     4.2.  NAS/DHCP Relay Agent Behavior  . . . . . . . . . . . . . . 13
     4.3.  DHCP Server Behavior . . . . . . . . . . . . . . . . . . . 14
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 16
   6.  IANA Consideration . . . . . . . . . . . . . . . . . . . . . . 17
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 18
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 19
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 19
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 19
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 20
   Intellectual Property and Copyright Statements . . . . . . . . . . 21





















Jang, et al.            Expires December 15, 2007               [Page 2]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


1.  Introduction

   Before a mobile node can engage in Mobile IPv6 signaling with a home
   agent, it should either know the IP address of the home agent via
   pre-configuration, or dynamically discover it.  Mobile IPv6
   specification [RFC3775] describes how home agents can be dynamically
   discovered by mobile nodes that know the home subnet prefix.  This
   scheme does not work when prefix information is not already available
   to the mobile node.  This problem can be solved by delivering one or
   more home subnet prefix information to the mobile node by means of
   DHCP.  Subsequently, the mobile node can engage in dynamic home agent
   discovery using the prefix information.  In addition to delivering
   the prefix information, DHCP can also be used to provide the IP
   addresses or FQDNs of the home agents that are available to the
   mobile node.  The solution involves defining new DHCP options to
   carry home subnet prefix, home agent IP address and FQDN information.

   As part of configuring the initial TCP/IP parameters, a mobile node
   can obtain home network information for the subnet it is directly
   attached to, other subnets in the visited domain, or a subnet from
   its home domain.  A mobile node can indicate its home network
   identity when roaming to the visited network in order to obtain the
   MIP6 bootstrap parameters from the home network.  As an example, the
   visited network may determine the home network of the mobile node
   based on the realm portion of the NAI (Network Access Identifier)
   used in access authentication.

   The mobile node may or may not be connected to the "home" subnet when
   it attempts to learn Mobile IPv6 home network information.  This
   allows operators to centrally deploy home agents while being able to
   bootstrap mobile nodes that are already roaming.  This scenario also
   occurs when HMIPv6 [RFC4140] is used, where the mobile node is
   required to discover the MAP (a special home agent) that is located
   multiple hops away from the mobile node's attachment point.

















Jang, et al.            Expires December 15, 2007               [Page 3]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   General mobility terminology can be found in [RFC3753].  The
   following additional terms, as defined in [RFC4640], are used in this
   document:

   Access Service Provider (ASP): A network operator that provides
   direct IP packet forwarding to and from the mobile node.

   Mobility Service Provider (MSP): A service provider that provides
   Mobile IPv6 service.  In order to obtain such service, the mobile
   node must be authenticated and authorized to obtain the Mobile IPv6
   service.

   Mobility Service Authorizer (MSA): A service provider that authorizes
   Mobile IPv6 service.































Jang, et al.            Expires December 15, 2007               [Page 4]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


3.  DHCP options for HA Dynamic Discovery

   This section introduces new DHCP options used for dynamic home agent,
   FQDN, or home prefix information discovery in Mobile IPv6.  The
   drafts [I-D.ietf-mip6-radius] and
   [I-D.ietf-mip6-bootstrapping-integrated-dhc] describe the complete
   procedure for home agent assignment among the mobile node, NAS, DHCP,
   and AAA entities for bootstrapping procedure in the integrated
   scenario.

3.1.  Home Network Identifier Option

   This option is used to carry the identifier of the target home
   network.  The mobile node MUST include this option along with its
   Option Request option in its request.




































Jang, et al.            Expires December 15, 2007               [Page 5]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       OPTION_MIP6-HNID        |           option-len          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     id-type   |    reserved   |                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
      .                                                               .
      .                    Home Network Identifier                    .
      .                                                               .
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

             option-code

                OPTION_MIP6-HNID (TBD)

             option-len

                Total length of the option in octets

             id-type

                The type of Home Network Identifier:

                    0    Visited domain (local ASP)

                    1    Target MSP

                    2    No preference

             reserved

                An 8-bit field reserved for future use.  The value MUST
                be initialized to 0 by the sender and MUST be ignored by
                the receiver.

             Home Network Identifier

                The identifier to specify the requested home network of
                the mobile node. This field MUST be set in the form of
                user's NAI [RFC4282] when the id-type is 1.

   The id-type 0 indicates the mobile node is interested in learning the
   home network information that pertains to the currently visited
   network.  This type can be used to discover local home agents in the
   local ASP.  In this case, the Home Network Identifier field SHOULD be
   set to 0.

   The id-type 1 indicates the mobile node is interested in learning the



Jang, et al.            Expires December 15, 2007               [Page 6]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


   home network information that pertains to the given realm.  This type
   can be used to discover home agents that are hosted by a user's home
   domain (MSA domain, as indicated by his/her NAI-based username
   --user@HomeRealm) or by any target domain.  The requested domain is
   specified in the Home Network Identifier field and can be a mobile
   node's home MSP or any MSP which has trust roaming relationship with
   the mobile node's MSA.

   If the mobile node has no preference, the id-type is set to 2 and the
   Home Network Identifier SHOULD be initialized to 0.  In this case,
   the assignment of the home network information is within the server's
   own discretion.  For the detailed processing, refer to section 4.

3.2.  MIP6 Relay Agent Option

   This option carries the RADIUS or Diameter attributes that are
   received at the NAS from the AAAH.  The DHCP relay agent sends this
   option to the DHCP server in the Relay-Forward message.


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6-RELAY       |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                          sub-options                          .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

            OPTION_MIP6-RELAY (TBD).

         option-len

            Total length of the option in octets

         sub-options
            A series of sub-options carrying MIP6 bootstrap
            information.


3.2.1.  MIP6 Relay Agent Sub-option

   This sub-option carries the assigned home network information to the
   DHCP server.






Jang, et al.            Expires December 15, 2007               [Page 7]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  sub-opt-code |  sub-opt-len  |   reserved    |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               +
   .                                                               .
   .                   Home Network Information                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         sub-opt-code

            The sub-option identifies the type of the following
            Home Network Information field. Possible values are:

                0    Home subnet prefix

                1    Complete IPv6 address of the home agent

                2    FQDN of the home agent

         sub-opt-len

            An 8-bit unsigned integer. Total length of the following
            Home Network Information field.

         reserved

            An 8-bit field reserved for future use.  The value MUST
            be initialized to 0 by the sender and MUST be ignored by
            the receiver.

         Home Network Information

            A home subnet prefix, home agent IP address or home agent
            FQDN to be provided to a mobile node according to the
            sub-opt-code.

   When the sub-opt-code is set to 0, the data field MUST contain the
   8-bit prefix length information followed by the 128-bit IPv6 address
   beginning with the available network prefix.

   When the sub-opt-code is set to 1, the data field MUST contain the
   128-bit IPv6 address of the home agent.

   When the sub-opt-code is set to 2, the data field MUST contain the
   FQDN as described in [RFC1035].

   Multiple sub-options may exist in a MIP6 Relay Agent option to carry



Jang, et al.            Expires December 15, 2007               [Page 8]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


   more than one home information.

3.3.  Home Network Information Option

   This option is used to carry home network information to a mobile
   node in the form of one or more of home subnet prefix(es), home agent
   address(es) and home agent FQDN(s).


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6-HNINF       |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     id-type   |    reserved   |                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
   .                          sub-options                          .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

            OPTION_MIP6-HNINF (TBD).

         option-len

            Total length of the option in octets

         id-type

            The type of Home Network Identifier:

                0    Visited domain (local ASP)

                1    Home domain

                2    No preference

         reserved

            An 8-bit field reserved for future use.  The value MUST
            be initialized to 0 by the sender and MUST be ignored by
            the receiver.

         sub-options

            A series of sub-options carrying MIP6 bootstrap
            information.




Jang, et al.            Expires December 15, 2007               [Page 9]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


3.3.1.  Home Network Information Sub-option

   This sub-option carries the assigned home network information to the
   DHCP client.


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  sub-opt-code |  sub-opt-len  |V|   reserved  |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               +
   .                                                               .
   .                   Home Network Information                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         sub-opt-code

            The type of the following Home Network Information field.
            Possible values are:

                0    Home subnet prefix

                1    Complete IPv6 address of the home agent

                2    FQDN of the home agent

         sub-opt-len

            An 8-bit unsigned integer. Total length of the following
            Home Network Information field.

         V flag

            This flag specifies the location of home network where
            the home agent is assigned. If it is set to 1, it means
            that the following Home Network Information is allocated
            from the visited network.

         reserved

            A 7-bit field reserved for future use. The value MUST
            be initialized to 0 by the sender and MUST be ignored by
            the receiver.

         Home Network Information

            A home subnet prefix, home agent IP address or home agent
            FQDN to be provided to a mobile node according to the



Jang, et al.            Expires December 15, 2007              [Page 10]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


            sub-opt-code.


   The sub-opt-code, sub-opt-len and Home Network Information fields are
   set in the same manner as those of a MIP6 Relay Agent sub-option.

   Multiple sub-options may exist in a Home Network Information option
   to carry more than one home information.

   The detailed processing for each id-type is described in section 4.









































Jang, et al.            Expires December 15, 2007              [Page 11]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


4.  Option Usage

   The requesting and sending of the proposed DHCP options follow the
   rules for DHCP options in [RFC3315].  The following DHCP options
   [RFC3315] are also required in the solution for normal DHCP
   operation:

   - Option Request option

   - Client Identifier option

   - Relay Message option

   - Interface-Id option

4.1.  Mobile Node Behavior

   In order to acquire the home network information, the mobile node
   SHALL send an Information Request to the
   All_DHCP_Relay_Agents_and_Servers multicast address.  In this message
   the mobile node (DHCP client) SHALL include the Option Code for Home
   Network Identifier option in the OPTION_ORO.  The mobile node SHALL
   also include the OPTION_CLIENTID [RFC3315] to identify itself to the
   DHCP server.

   During the process of requesting the bootstrapping information, the
   mobile node MUST clarify the preference about the requested home
   network with the id-type in the Home Network Identifier option.  Even
   if the mobile node does not care about the location of the home
   network where the home agent to be assigned, it MUST clarify the fact
   by setting the id-type to 2.  In this case the Home Network
   Identifier SHOULD be set to 0.

   The mobile node can request more than one home information by using
   multiple Home Network Identifier options in the request.  For
   instance, if the mobile node wants to retrieve home network
   information from both the visited network (ASP) and the home network
   with a single transaction, it can request the information by using
   two Home Network Identifier options with the id-type 0 and the id-
   type 1.  It can also request the home information for more than one
   target MSPs at the same time by including multiple Home Network
   Identifier options with id-type 1.

   When the mobile node receives a Reply message from the DHCP server
   and gets more than one home agent address(es), it MUST have a
   selection mechanism to determine which one to use for establishing a
   Mobile IPv6 session.  For example, if the mobile node acquires both
   IPv6 address and FQDN of the home agent, it may try to use the



Jang, et al.            Expires December 15, 2007              [Page 12]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


   address information of the home agent first.

   If a Home Network Information option carries sub-option whose 'V'
   flag does not match the id-type, the mobile node SHOULD skip that
   sub-option.

   When the mobile node requests the home network information with the
   id-type 0 or 1 but cannot be provided with the proper information,
   that is, option-len = 0 in the Home Network Information option, then
   it may request again by setting the id-type to 2 in the Home Network
   Identifier option.

4.2.  NAS/DHCP Relay Agent Behavior

   The NAS and the DHCP relay agent are assumed to be collocated in this
   solution.  The NAS communicates with the mobile node during the
   network access authentication and interacts with the AAAH (via the
   AAAV) using either Diameter NASREQ [RFC4005] or RADIUS
   [I-D.ietf-mip6-radius] [Editor's note: The Diameter AVPs need to be
   defined].

   Upon receiving the MIP6 related RADIUS or Diameter attributes
   returned by the AAAH, the NAS passes the information to the
   collocated DHCP relay agent.

   Upon receiving the Information Request from the mobile node, the DHCP
   relay agent MUST forward the message to the DHCP server as per
   [RFC3315].  The relay agent SHALL use the OPTION_CLIENTID to identify
   the mobile node (user).  This is required to check whether there are
   some additional information for the user that need to be appended
   while relaying the information request message to the DHCP server.
   If the relay agent determines that the NAS has passed home network
   information for this mobile node, the relay agent MUST include the
   received home network information in the MIP6 Relay Agent option, and
   attach this option in the Relay-Forward message.  The relay agent MAY
   include the Interface-Id option [RFC3315] in the Relay-Forward
   message.

   The sub-options that carry home information for the same home agent
   should be listed in sequential order of a sub-opt-code in the MIP6
   Relay Agent option so as to indicate the coupling among home network
   information for the same home agent.  For example, the sub-options
   for HA1 and HA2 are listed as follows.

   sub-opt-code = 1 (HA1's IPv6 address)

   sub-opt-code = 2 (HA1's FQDN)




Jang, et al.            Expires December 15, 2007              [Page 13]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


   sub-opt-code = 0 (Home subnet prefix under HA2)

   sub-opt-code = 1 (HA2's IPv6 address)

   sub-opt-code = 2 (HA2's FQDN)

   Upon receiving a Reply message from the DHCPv6 server, the relay
   agent SHALL follow the guidelines defined in [RFC3315] to forward the
   message to the mobile node.

4.3.  DHCP Server Behavior

   The DHCP server MUST follow the following logic to process an
   Information Request from the mobile node.

   Information Request message includes:

   A. OPTION_ORO and Home Network Identifier option with the id-type 0,
   Interface-Id option, Client Identifier option, MIP6 Relay Agent
   option.

   If the DHCP server is configured with the local home information, it
   MUST include the corresponding information in the Home Network
   Information option of the Reply message, and set all of the V flag(s)
   in its sub-option(s) to 1(s).  The information may have been
   configured statically in the server.

   B. OPTION_ORO and Home Network Identifier option with the id-type 1,
   Interface-Id option, Client Identifier option, MIP6 Relay Agent
   option.

   If the received Home Network Identifier option does not carry any
   target MSP, the option MUST be skipped.

   If the DHCP server has the corresponding information for the target
   MSP, it MUST include the home information in the Home Network
   Information option, and set all of the V flag(s) in its sub-option(s)
   to 0(s).  The server may provide the matching information extracted
   from the MIP6 Relay Agent option.

   C. OPTION_ORO and Home Network Identifier option with the id-type 2,
   Interface-Id option, Client Identifier option, MIP6 Relay Agent
   option.

   In this case, the assignment of the home information relies on the
   server's local policy, and the DHCP server SHOULD have its own policy
   so that it can reply with the proper information in the Home Network
   Information option.  The policy can be determined based on several



Jang, et al.            Expires December 15, 2007              [Page 14]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


   factors such as the home agent availability and the authorization
   information of the mobile node.  However, the specific policy setting
   is not in the scope of this document.  The V flag(s) is/are set to
   0(s) or 1(s) according to the type of provided home network
   information.

   The server SHOULD provide all of the matching home information in
   Home Network Information option(s).  When the server has more than
   one home network information to provide for a single Home Network
   Identifier option, it SHOULD include each of them in Home Network
   Information sub-options and include these sub-options in a single
   Home Network Information option.  The sub-options for the same home
   agent SHOULD be listed in sequential order of a sub-opt-code in the
   Home Network Information option as described in section 4.2.  In case
   of the id-type 0 and 1, the V flags in all sub-options in a Home
   Network Information option SHOULD be set to 1s and 0s respectively.

   If the request message carries more than one Home Network Identifier
   options, the reply message MUST contain Home Network Information
   options as many as Home Network Identifier options in the request.
   Though the server cannot find any home information for a specific id-
   type, it MUST return the Home Network Information option by setting
   the id-type to the requested id-type and the option-len to 0.  The
   Home Network Information options in the reply SHOULD appear in the
   same order as Home Network Identifier options in the request and the
   matching is based on the sequential order of options.  This provides
   a way of matching for Home Network Information options with the same
   id-type.

   In all Reply messages, the DHCP server MUST return the Interface-Id
   option as received in the Information Request.  The DHCP server
   SHOULD use the Client Identifier option to identify the mobile node.

   There can be various ways that a DHCP server learns mechanism to know
   or retrieve the requested home network information.  For instance, as
   described in [I-D.ietf-mip6-radius], the NAS can learn the
   information via RADIUS during network access authentication, and NAS-
   collocated DHCP relay can transfer it to the DHCP server by the
   proposed DHCP option in this document.  However, the mechanism by
   which the DHCP server is provisioned with the home network
   information or obtains it dynamically is outside the scope of this
   document.









Jang, et al.            Expires December 15, 2007              [Page 15]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


5.  Security Considerations

   Secure delivery of home agent and home network information from a
   DHCP server to the mobile node (DHCP client) relies on the same
   security as DHCP.  The particular option defined in this draft does
   not have additional impact on DHCP security.

   Aside from the DHCP client to server interaction, an operator must
   also ensure secure delivery of mobile IP information to the DHCP
   server.  This is outside the scope of DHCP and the newly defined
   option.








































Jang, et al.            Expires December 15, 2007              [Page 16]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


6.  IANA Consideration

   This document defines three new DHCPv6 options, Home Network
   Identifier option, MIP6 Relay Agent option and Home Network
   Information option.

   IANA is requested to assign the following new DHCPv6 Option Codes in
   the registry maintained in
   http://www.iana.org/assignments/dhcpv6-parameters:

       o OPTION_MIP6-HNID for the Home Network Identifier option
       o OPTION_MIP6-RELAY for the MIP6 Relay Agent option
       o OPTION_MIP6-HNINF for the Home Network Information option






































Jang, et al.            Expires December 15, 2007              [Page 17]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


7.  Acknowledgements

   The authors would like to thank Kilian Weniger, Domagoj Premec,
   Basavaraj Patil, Vijay Devarapalli, Gerardo Giaretta, Behcet
   Sarikaya, Vidya Narayanan and Miguel A. Diaz for their valuable input
   and comments.













































Jang, et al.            Expires December 15, 2007              [Page 18]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


8.  References

8.1.  Normative References

   [I-D.ietf-mip6-bootstrapping-integrated-dhc]
              Chowdhury, K. and A. Yegin, "MIP6-bootstrapping for the
              Integrated Scenario",
              draft-ietf-mip6-bootstrapping-integrated-dhc-04 (work in
              progress), June 2007.

   [I-D.ietf-mip6-radius]
              Chowdhury, K., "RADIUS Mobile IPv6 Support",
              draft-ietf-mip6-radius-02 (work in progress), March 2007.

   [RFC1035]  Mockapetris, P., "Domain names - implementation and
              specification", STD 13, RFC 1035, November 1987.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

   [RFC3775]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support
              in IPv6", RFC 3775, June 2004.

   [RFC4005]  Calhoun, P., Zorn, G., Spence, D., and D. Mitton,
              "Diameter Network Access Server Application", RFC 4005,
              August 2005.

   [RFC4282]  Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The
              Network Access Identifier", RFC 4282, December 2005.

8.2.  Informative References

   [RFC3753]  Manner, J. and M. Kojo, "Mobility Related Terminology",
              RFC 3753, June 2004.

   [RFC4140]  Soliman, H., Castelluccia, C., El Malki, K., and L.
              Bellier, "Hierarchical Mobile IPv6 Mobility Management
              (HMIPv6)", RFC 4140, August 2005.

   [RFC4640]  Patel, A. and G. Giaretta, "Problem Statement for
              bootstrapping Mobile IPv6 (MIPv6)", RFC 4640,
              September 2006.





Jang, et al.            Expires December 15, 2007              [Page 19]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


Authors' Addresses

   Hee Jin Jang
   Samsung Advanced Institute of Technology
   P.O. Box 111
   Suwon 440-600
   Korea

   Email: heejin.jang@samsung.com


   Alper E. Yegin
   Samsung Electronics
   Istanbul
   Turkey

   Email: alper01.yegin@partner.samsung.com


   Kuntal Chowdhury
   Starent Networks
   30 International Place
   Tewksbury, MA  01876
   US

   Email: kchowdhury@starentnetworks.com


   JinHyeock Choi
   Samsung Advanced Institute of Technology
   P.O. Box 111
   Suwon 440-600
   Korea

   Email: athene@sait.samsung.co.kr
















Jang, et al.            Expires December 15, 2007              [Page 20]

Internet-Draft  DHCP Opt for Home Info Discovery in MIPv6      June 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Jang, et al.            Expires December 15, 2007              [Page 21]


